adekwatnie do dataseries - tworzymy filtry jako zmienne i łączymy

**w series jednak uzywalem metody where**

df[filtr1 & (filtr2 | ~filtr3)]

AND jest interpretowane najpierw, potem OR

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

%matplotlib inline

In [2]:
fortune = pd.read_csv(r"..\course-files\Fortune_500_2017.csv", usecols=['Rank','Title','Employees','Profits','Assets'],
                     index_col="Rank")
fortune.head()

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

In [3]:
fortune.Employees.rank(ascending=False).head()

Rank
1      1.0
2      7.0
3     57.0
4     94.0
5    104.5
Name: Employees, dtype: float64

In [4]:
fortune["RankByEmployee"] = fortune.Employees.rank(ascending=False)
fortune.head()

                   Title  Employees  Profits  Assets  RankByEmployee
Rank
1                Walmart    2300000  13643.0  198825             1.0
2     Berkshire Hathaway     367700  24074.0  620854             7.0
3                  Apple     116000  45687.0  321686            57.0
4            Exxon Mobil      72700   7840.0  330314            94.0
5               McKesson      68000   2258.0   56563           104.5

In [5]:
fortune.Profits.rank(ascending=False).head()

Rank
1     11.0
2      3.0
3      1.0
4     27.0
5    102.0
Name: Profits, dtype: float64

In [6]:
fortune["RankByProfits"] = fortune.Profits.rank(ascending=False)
fortune.head()

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0

In [7]:
isEmployeesRankFirst10 = fortune.RankByEmployee <= 10
isProfitRankFirst10 = fortune.RankByProfits <= 10

In [8]:
fortune[isEmployeesRankFirst10 & isProfitRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0

In [9]:
isEmployeesRankMore400 = fortune.RankByEmployee >= 400

In [10]:
fortune[isProfitRankFirst10 & isEmployeesRankMore400]

             Title  Employees  Profits  Assets  RankByEmployee  RankByProfits
Rank
148   Altria Group       8300  14239.0   45932           424.0           10.0